[
    {
        "title": "Goalkeeper Motion Generation Using Optimal Control Problem Enhanced Reinforcement Learning",
        "description": "Previous works have shown that it's possible to generate goalkeeper motion primitives by learning from humans and treating it as a pure reinforcement learning problem. However, this approach can be suboptimal because it doesn't enforce kinematic constraints, only a best-effort behavior. Moreover, a fully learning-based approach doesn't take advantage of prior information, such as the ball's dynamics and its evolution. Combining the strengths of control and reinforcement learning could improve performance, ensure feasible solutions, and enforce intrinsic stability. Finally, a physically-informed learning problem may be more efficient and more stable during the learning phase.",
        "target": "Thesis",
        "resources": [
            {
                "Name": "Humanoid Goalkeeper",
                "Paper": "https://www.arxiv.org/pdf/2510.18002",
                "GitHub": "https://github.com/InternRobotics/Humanoid-Goalkeeper/"
            }
        ],
        "contacts": [
            {
                "name": "Daniele Affinita",
                "email": "daniele.affinita@epfl.ch"
            },
            {
                "name": "Flavio Maiorana",
                "email": "flavio.maiorana@uniroma1.it"
            }
        ]
    },   

    


    {
        "title": "Humanoid Robot Imitation Learning from Videos",
        "description": "A project focused on developing a humanoid robot capable of learning from people actions using imitation learning techniques. The robot learns to mimic human gestures to create more complex actions. The idea is to use MuJoCo Lab combined with MimicKit to train the agent starting from videos of human actions.",
        "target": "Project",
        "resources": [
            {
                "Name": "Mujoco Lab",
                "GitHub": "https://github.com/mujocolab/mjlab"
            },
            {
                "Name": "MimicKit",
                "GitHub": "https://github.com/xbpeng/MimicKit"
            }
        ],
        "contacts": [
            {
                "name": "Flavio Maiorana",
                "email": "flavio.maiorana@uniroma1.it"
            },
            {
                "name": "Michele Brienza",
                "email": "brienza@diag.uniroma1.it"
            }
        ]
    },

    {
        "title": "Obstacle avoidance for humanoid robots",
        "description": "Create an environment in MuJoCo Lab where a humanoid robot has to navigate through a field of moving obstacles. The robot should learn to avoid collisions while reaching a target location. The project will involve setting up the simulation environment, defining the robot's sensors to use for obstacle detection, and implementing a path planning algorithm that allows the robot to navigate safely.",
        "target": "Project",
        "resources": [
            {
                "Name": "Mujoco Lab",
                "GitHub": "https://github.com/mujocolab/mjlab"
            },
            {
                "Name": "Mujoco Playground",
                "GitHub": "https://github.com/google-deepmind/mujoco_playground"
            }
        ],
        "contacts": [
            {
                "name": "Flavio Maiorana",
                "email": "flavio.maiorana@uniroma1.it"
            },
            {
                "name": "Valerio Spagnoli",
                "email": "valerio.spagnoli@uniroma1.it"
            }
        ]
    }


]